       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. coboltut.
AUTHOR. Tajul Tijerina.
DATE-WRITTEN.November 1st 2022
ENVIRONMENT DIVISION.

DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.


PROCEDURE DIVISION.


STOP RUN.
