       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. coboltut3.
AUTHOR. 
DATE-WRITTEN.November 2nd 2022
ENVIRONMENT DIVISION.

CONFIGURATION SECTION.


DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.


PROCEDURE DIVISION.


STOP RUN.
