       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. coboltut13.

DATA DIVISION.

WORKING-STORAGE SECTION.



PROCEDURE DIVISION.




STOP RUN.          



       
      

     
       





