       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. GETSUM.
AUTHOR. 
DATE-WRITTEN.November 2nd 2022
ENVIRONMENT DIVISION.

CONFIGURATION SECTION.


DATA DIVISION.
LINKAGE SECTION.
       01 LNum1   PIC 9 VALUE 5.
       01 LNum2   PIC 9 VALUE 4.
       01 LSum1   PIC 99.

FILE SECTION.
WORKING-STORAGE SECTION.


PROCEDURE DIVISION.



STOP RUN.
