       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. GETSUM.
AUTHOR. 
DATE-WRITTEN.November 2nd 2022
ENVIRONMENT DIVISION.

CONFIGURATION SECTION.


DATA DIVISION.
LINKAGE SECTION.

FILE SECTION.
WORKING-STORAGE SECTION.


PROCEDURE DIVISION.



STOP RUN.
