      *****************************************************************
      * Program name:   hello_world                               
      * Original author: MYNAME                                
      *
      * Maintenence Log                                              
      * Date      Author        Maintenance Requirement               
      * --------- ------------  --------------------------------------- 
      * 01/01/08 MYNAME  Created for COBOL class         
      *                                                               
      *****************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello_world.
       AUTHOR. MYNAME. 
       INSTALLATION. COBOL DEVELOPMENT CENTER. 
       DATE-WRITTEN. 11/07/2022. 
       DATE-COMPILED. 11/07/2022. 
       SECURITY. NON-CONFIDENTIAL.
      *****************************************************************
       PROCEDURE DIVISION.
       DISPLAY "Hello, world."
       STOP RUN.
       